<details><summary>This apply is out of date. A new apply has been performed.</summary>

> 
> **Terraform apply** (Okta preview) ran in [4 seconds](https://github.com/evanyeung-clear/terraform-ci/actions/runs/20101684240).
> ```
> terraform apply -no-color -input=false -auto-approve 
> ```
> 
> <details>
> <summary>Error: failed to create user: the API returned an error: Internal Server Error, x-okta-request-id=7a11b2c88a370c51c11cd24dfd142e88
> </summary>
> 
> ```
> [INFO] Starting Terraform preprocessing in terraform environment...
> [INFO] Cleaning up existing temporary files...
> [INFO] Consolidating .tf files from subdirectories into _consolidated.tf...
> [INFO] Consolidated 0 files into _consolidated.tf
> [INFO] Running terraform with arguments: apply -no-color -input=false -auto-approve
> [INFO] Using terraform executable: /usr/local/bin/terraform
> 
> Terraform used the selected providers to generate the following execution
> plan. Resource actions are indicated with the following symbols:
>   + create
> 
> Terraform will perform the following actions:
> 
>   # okta_user.test1 will be created
>   + resource "okta_user" "test1" {
>       + custom_profile_attributes = (known after apply)
>       + email                     = "example@example.com"
>       + expire_password_on_create = false
>       + first_name                = "John"
>       + id                        = (known after apply)
>       + last_name                 = "Smith"
>       + login                     = "example@example.com"
>       + raw_status                = (known after apply)
>       + skip_roles                = false
>       + status                    = "ACTIVE"
>     }
> 
>   # okta_user.test2 will be created
>   + resource "okta_user" "test2" {
>       + custom_profile_attributes = (known after apply)
>       + email                     = "example@example.com"
>       + expire_password_on_create = false
>       + first_name                = "John"
>       + id                        = (known after apply)
>       + last_name                 = "Smith"
>       + login                     = "example@example.com"
>       + raw_status                = (known after apply)
>       + skip_roles                = false
>       + status                    = "ACTIVE"
>     }
> 
> Plan: 2 to add, 0 to change, 0 to destroy.
> okta_user.test2: Creating...
> okta_user.test1: Creating...
> okta_user.test1: Creation complete after 2s [id=00uy830uq2AvXAUwY697]
> 
> Error: failed to create user: the API returned an error: Internal Server Error, x-okta-request-id=7a11b2c88a370c51c11cd24dfd142e88
> 
>   with okta_user.test2,
>   on users.tf line 8, in resource "okta_user" "test2":
>    8: resource "okta_user" "test2" {
> 
> [INFO] Cleaning up temporary file...
> 
> 
> ```
> </details>
> 
</details>